# IFCParameter Template Export To File Method

Source: https://www.revitapidocs.com/2026/c329302b-92c6-93ae-b8e4-fcf4b76422be.htm

---

| IFCParameter Template Export To File Method |
| --- |

Export mapping template to a text file.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public void ExportToFile(
	string fileName
)
```

```
Public Sub ExportToFile (
	fileName As String
)
```

```
public:
void ExportToFile(
	String^ fileName
)
```

```
member ExportToFile :
        fileName : string -> unit
```

#### Parameters

fileName String
:   The full text file name.

Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |
| FileAccessException | Failed to access the text file. |

See Also

#### Reference

IFCParameterTemplate Class Autodesk.Revit.DB Namespace